
MVI A, 30h       ; Деленик, на пример 48
MVI B, 06h       ; Делител, на пример 6
MVI C, 00h       ; Иницијализација на количник
MVI D, 00h       ; Иницијализација на остаток

; Започнување на делбата
START:
CMP B            ; Споредба на A со B
JC END           ; Ако A < B, премини на крај
SUB B            ; A = A - B
INR C            ; Увеличи го количникот
JMP START        ; Повтори

END:
MOV D, A         ; Остатокот го префрламе во D

; Резултат:
; Количникот е во регистерот C (променлива n)
; Остатокот е во регистерот D (променлива m)

HLT              ; Стоп
